# - Trabalhando com o Pandas

In [1]:
##### - Pandas é uma biblioteca de código fonte aberto escrita sobre o Numpy
##### - Permite rápida visualização e limpeza de dados
##### - É muito semlhante ao Excel
##### - POde trabalhar com dados de diversos tipos diferentes
##### - Possui métodos próprios de visualização de dados.

In [4]:
# Series
# Dataframes
# Dados ausentes
# Groupy
# Concaternar, juntar e mesclar
# Operações
# Entrada e saídas de dados

# - Séries

é o objeto básico do pandas (Existem duas estruturas no Pandas os dataframes e as séries, as series são estruturas mais simples)

exemplo

In [1]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']

In [4]:
minha_lista = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a':10, 'b':20, 'c':30}

In [5]:
# qualquer um dos valores acima pode ser transformado em uma série

In [6]:
pd.Series(data = minha_lista, index = labels)

a    10
b    20
c    30
dtype: int64

In [12]:
# os valores foram associados, de forma que podemos acessar os valores pelos indexes asssociados

In [7]:
serie = pd.Series(data = minha_lista, index = labels)

In [8]:
serie['a']

10

In [9]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [17]:
# exemplo

In [10]:
ser1 = pd.Series([1, 2, 3, 4], index = ['EUA', 'Alemanha', 'Russia', 'Japão'] )

In [11]:
ser1

EUA         1
Alemanha    2
Russia      3
Japão       4
dtype: int64

In [12]:
ser2 = pd.Series([1, 2, 3, 4], index = ['EUA', 'Alemanha', 'Italia', 'China'] )

In [13]:
ser2

EUA         1
Alemanha    2
Italia      3
China       4
dtype: int64

In [22]:
ser1 + ser2

Alemanha    4.0
China       NaN
EUA         2.0
Italia      NaN
Japão       NaN
Russia      NaN
dtype: float64

In [23]:
# com series as operações são realizadas atraves dos indeces.

# - Dataframes

In [24]:
# O Dataframe é a estrutura principal do pandas, ele é um conjunto de séries

In [14]:
np.random.seed(101)

In [15]:
df = pd.DataFrame(np.random.randn(5,4), index = 'A B C D E'.split(), columns ='W X Y Z'.split())

In [16]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

##### - a indexação em um DataFrame

In [17]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [29]:
# as colunas dos DataFrames são Séries

In [18]:
type(df['W'])

pandas.core.series.Series

In [19]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [32]:
# criando novas colunas

In [20]:
df['A'] = df['W'] + df ['X']

In [21]:
df

          W         X         Y         Z         A
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [35]:
# como deletar uma coluna

In [36]:
# usando o método drop, deve-se salvar o dataframe numa nova variavel ou na mesma váriavel, ou usar o inplace

In [22]:
df.drop('A', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
# porem, sem salvvar o DataFrame em uma variavel ou usar o método inplace a coluna não será realmente deletaada

In [23]:
df

          W         X         Y         Z         A
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [24]:
df1 = df.drop('A', axis=1)

In [25]:
df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df1.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [27]:
df1.loc[['A','B'],['X','Y','Z']]

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965

In [57]:
# o método loc, procura os elementos no dataframe usando os indices e as colunas
# já o método iloc funciona igual a indexação do numpy

In [28]:
df1.iloc[1:4, 2:]

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057

### - Seleção Condicional, set_index

In [29]:
df1 > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [30]:
bol = df1 > 0

In [31]:
df1[bol]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

podemos definir uma variavel passando um teste condicional, e fazer uma selação igual como fazemos com o numpy. o retorno é um dataframe do mesmo tamanho, mas, só com os valores correspondendtes a condição.

também podemos fazer testes em séries especificas.

In [32]:
df1[df1['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Fazendo um teste condicional apenas para os valores da linha W que são maiores doque zero, o valor retornada exclui a linha C pois é o unico valor desse linha menor que zero.

A filtragem também pode ser feita relacionando duas séries

In [33]:
df1[df1['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

Para as posições em W onde os valores são menores que 0 foram retornados os valores de Y nas mesmas posições

A filtragem pode ser feita com varias condicionais.

In [36]:
df1[(df1['W']>0) & (df1['Y']>1)]  #usando o simbolo & no lugar do and

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df1[(df1['W']>0) | (df1['Y']>1)]   #usando o símbolo | no lugar do OR

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df1.reset_index(inplace = True)

In [39]:
df1

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [40]:
col = 'RS RJ SP AM SC'.split()

In [41]:
col

['RS', 'RJ', 'SP', 'AM', 'SC']

In [42]:
df1['Estado'] = col

In [43]:
df1

  index         W         X         Y         Z Estado
0     A  2.706850  0.628133  0.907969  0.503826     RS
1     B  0.651118 -0.319318 -0.848077  0.605965     RJ
2     C -2.018168  0.740122  0.528813 -0.589001     SP
3     D  0.188695 -0.758872 -0.933237  0.955057     AM
4     E  0.190794  1.978757  2.605967  0.683509     SC

In [44]:
df1.set_index('Estado', inplace = True)

In [45]:
df1

       index         W         X         Y         Z
Estado
RS         A  2.706850  0.628133  0.907969  0.503826
RJ         B  0.651118 -0.319318 -0.848077  0.605965
SP         C -2.018168  0.740122  0.528813 -0.589001
AM         D  0.188695 -0.758872 -0.933237  0.955057
SC         E  0.190794  1.978757  2.605967  0.683509

## - Índices Multiníveis (uma maneira de criar subdiviões nos indices)

In [50]:
# Níveis de índice
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside)) #método 'zip' foi usado para pegar os valores de 'outside' e 'inside' para uma lista 
hier_index = pd.MultiIndex.from_tuples(hier_index) # de tuplas, onde cada valor da 1° lista é associado a 2°.

In [51]:
df2 = pd.DataFrame(np.random.rand(6,2), index = hier_index, columns = ['A', 'B'])

In [52]:
df2

             A         B
G1 1  0.097146  0.102847
   2  0.701507  0.890480
   3  0.159560  0.275573
G2 1  0.672492  0.164303
   2  0.701371  0.487635
   3  0.680678  0.521548

In [53]:
df2.loc['G1']

          A         B
1  0.097146  0.102847
2  0.701507  0.890480
3  0.159560  0.275573

In [54]:
df2.loc['G1'].loc[1]

A    0.097146
B    0.102847
Name: 1, dtype: float64

In [55]:
df2.index.names = ['Grupo', 'Numero']

In [56]:
df2

                     A         B
Grupo Numero
G1    1       0.097146  0.102847
      2       0.701507  0.890480
      3       0.159560  0.275573
G2    1       0.672492  0.164303
      2       0.701371  0.487635
      3       0.680678  0.521548

In [57]:
df2.xs (1, level ='Numero')  # xs método cross section

              A         B
Grupo
G1     0.097146  0.102847
G2     0.672492  0.164303

## - dados ausentes

In [58]:
## Ao trabalhar com bancos de dados você acara listando com bancos de dados incompletos. Pandas tem recursos para lidar
## com esses dados ausentes

In [59]:
d = {'A':[1,2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}

In [60]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [61]:
df3 = pd.DataFrame(d)

In [62]:
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [63]:
# como lidar com os valores ausentes, que aparecem no dataframe como 'NaN'

In [64]:
df3.dropna()

     A    B  C
0  1.0  5.0  1

In [65]:
df3.dropna(thresh = 2) # com o parametro thresh = 2 são excluidos somente quando há mais de dois valores faltando.

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [66]:
df3.fillna(value = 'Fill na')  # substitui o valor faltando pela string

         A        B  C
0        1        5  1
1        2  Fill na  2
2  Fill na  Fill na  3

In [67]:
df3['A'].fillna(value = df3['A'].mean()) #usando o método Fillna para substituir os valores ausentes na coluna 'A' pela média

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [70]:
df3.fillna(method = 'ffill') #método usando 'method' com fillna os valores ausentes são preenchidos por valores anterios 
                             #da mesma cooluna

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [71]:
### -- OBSERVAÇÃO: o como "inplace" não foi utilizado então o dataframe df3 não foi modificado.

## - GroupBy

In [84]:
import pandas as pd
# Cria um DataFrame
data = {'Empresa':['GOOG','GOOG','MFST','MFST','FB','FB'], 'Nome': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'], 'Venda':[200, 120, 340, 124, 243, 350]}

In [85]:
df4 = pd.DataFrame(data)

In [86]:
df4   # ao criar esse DataFrame as chaves do dicionario viram as colunas e os valores associados a chave preenchem as colunas

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MFST      Amy    340
3    MFST  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [87]:
group = df4.groupby('Empresa') # atráves desse método os valores associados são agrupados através do parametro "Empresa"

In [88]:
group

In [89]:
group.sum()   # com o método sum() os valores númericos são somados, por isso nada é feito a coluna nome

         Venda
Empresa
FB         593
GOOG       320
MFST       464

In [90]:
group.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MFST        2      2

In [92]:
group_1 = df4.groupby('Nome')  # criamos um novo agrupamento como parametro a coluna "Nome"

In [94]:
group_1.sum().loc['Amy']       # usando  .loc[] procuramos apenas pelos valores associados a 'Amy'

Venda    340
Name: Amy, dtype: int64

## - Concaternar, juntar e Mesclar

Existem 3 principais formas de combinar DataFrames: Merging, Joining e Concatenação.

In [95]:
dfA = pd.DataFrame({'A':['A0', 'A1', 'A2', 'A3'],
                    'B':['B0', 'B1', 'B2', 'B3'],
                    'C':['C0', 'C1', 'C2', 'C3'],
                    'D':['D0', 'D1', 'D2', 'D3']}, index = [0, 1, 2, 3])

In [96]:
dfB = pd.DataFrame({'A':['A4', 'A5', 'A6', 'A7'],
                    'B':['B4', 'B5', 'B6', 'B7'],
                    'C':['C4', 'C5','C6',  'C7'],
                    'D':['D4', 'D5','D6', 'D7']}, index = [4, 5, 6, 7])

In [97]:
dfC = pd.DataFrame({'A':['A8', 'A9', 'A10', 'A11'],
                    'B':['B8', 'B9', 'B10', 'B11'],
                    'C':['C8', 'C9', 'C10', 'C11'],
                    'D':['D8', 'D9', 'D10', 'D12']}, index = [8, 9, 10, 11])

In [98]:
dfA

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [103]:
dfB

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [100]:
dfC

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D12

# concatenação

Basicamente junta DataFrames. As dimensões dos DataFrames devem ser a mesma ao longo do eixo que está sendo concatenado

In [102]:
pd.concat([dfA, dfB, dfC]) # sem passar nenhum parametro adicional a concatenação é feita com as colunas que tem o mesmo nome

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D12

In [104]:
pd.concat([dfA, dfB, dfC], axis=1)  # passando o parametro 'axis=1', fazemos com a concatenação ocorra adicionando as colunas
                                    # os valores que não existem para os outros indexes são completados automaticamente

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D12

## - Método Mesclar (Merging)

A função mesclar permite que você mescle os quadros de dados juntos usando uma lógica semelhante à mesclagem de tabelas SQL

In [105]:
esquerda = pd.DataFrame({'key':['k0', 'k1', 'k2', 'k3'],
                          'A': ['A0', 'A1', 'A2', 'A3'],
                          'B': ['B0', 'B1', 'B2', 'B3']})

direita = pd.DataFrame({'key': ['k0', 'k1', 'k2', 'k3'],
                          'A': ['C0', 'C1', 'C2', 'C3'],
                          'B': ['D0', 'D1', 'D2', 'D3']})

In [106]:
esquerda

  key   A   B
0  k0  A0  B0
1  k1  A1  B1
2  k2  A2  B2
3  k3  A3  B3

In [107]:
direita

  key   A   B
0  k0  C0  D0
1  k1  C1  D1
2  k2  C2  D2
3  k3  C3  D3

In [108]:
pd.merge(esquerda, direita, how ='inner', on = 'key')

  key A_x B_x A_y B_y
0  k0  A0  B0  C0  D0
1  k1  A1  B1  C1  D1
2  k2  A2  B2  C2  D2
3  k3  A3  B3  C3  D3

## - Juntar (Join)

Juntar é um método conveniente para combinar as colunas de dois DataFrames indexados potencialmente diferentes em um único DataFrame resultante.

In [109]:
esquerda = pd.DataFrame({'A':['A0', 'A1', 'A2'],
                         'B':['B0', 'B1', 'B2']}, index = ['K0', 'K1', 'K2'])

direita  = pd.DataFrame({'C':['C0', 'C2', 'C3'],
                         'D':['D0', 'D2', 'D3']}, index = ['K0', 'K2', 'K3'])  

# estes dataframes possuem indices diferentes

In [111]:
esquerda.join(direita) # os valores dos dois Dataframes serão unidos considerando os indices do DataFrame 'esquerda'
                       # que se repetem no DataFrame 'Direita'

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [113]:
esquerda.join(direita, how ='outer') #passando o parametro how = 'outer' os indices são unidos

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operações com Pandas

In [115]:
df = pd.DataFrame({'col1':[1, 2, 3, 4], 'col2':[444, 555, 666, 444], 'col3':['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [116]:
df['col2'].unique()  # encontrar valores unicos

array([444, 555, 666], dtype=int64)

In [118]:
df['col2'].value_counts() # conta quantas vezes um determina valor apareceu

444    2
555    1
666    1
Name: col2, dtype: int64

Podemos definir funções e aplica-las aos DataFrames usando o método apply.

In [121]:
def vezes2(x):
    return x*2

In [122]:
df['col1'].apply(vezes2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

Também é possivel usar o método apply usando funções lambdas

In [123]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

Também é possivel ordenar os elementos de um DataFrame

In [124]:
df.sort_values(by = 'col2', inplace = True) #O inplace deve ser utilizado para que as alterações tornem-se permanentes.

In [126]:
df # o resultado vai mostrar os valores do DataFrame ordenados sguindo a ordem crescente da coluna 2

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [129]:
data = {'A': ['GOOG','GOOG','MFST','MFST','FB','FB'], 
        'B': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'], 
        'C': [1, 2, 3, 4, 5, 6],
        'D': ['x','y','x','y','x','x']}

df = pd.DataFrame(data)

In [130]:
df

      A        B  C  D
0  GOOG      Sam  1  x
1  GOOG  Charlie  2  y
2  MFST      Amy  3  x
3  MFST  Vanessa  4  y
4    FB     Carl  5  x
5    FB    Sarah  6  x

In [131]:
df.pivot_table(values = 'C', index = ['A', 'B'], columns = ['D'] )

D               x    y
A    B
FB   Carl     5.0  NaN
     Sarah    6.0  NaN
GOOG Charlie  NaN  2.0
     Sam      1.0  NaN
MFST Amy      3.0  NaN
     Vanessa  NaN  4.0

# - Entrada e Saídas de Dados

In [3]:
# - O Pandas também pode criar DataFrames atráves da importação de arquivos, para isso é utilizado o método
#    read_tipo_do_arquivo.
# - É possivel ler aquivos do tipo Excel, txt, e também mais utilizado csv.

In [6]:
df = pd.read_csv('C:/Users/bruno/OneDrive/Data_Science/Python-Data-Science-and-Machine-Learning-Bootcamp/2. Python para análise de dados/Pandas/exemplo.csv', sep = ',')

In [7]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [8]:
df = df + 1

In [9]:
df

   Unnamed: 0   a   b   c   d
0           1   1   2   3   4
1           2   5   6   7   8
2           3   9  10  11  12
3           4  13  14  15  16

In [10]:
df.to_csv("exemplo_II.csv", sep = ',', decimal = ',')   # através do código exportamos o arquivo.